#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_iam_user.canellas: Refreshing state... [id=EduardoCanellas]
aws_iam_user.petrolifero: Refreshing state... [id=petrolifero]
aws_dynamodb_table.lockState: Refreshing state... [id=terraform-state-locking]
aws_s3_bucket.state: Refreshing state... [id=terraform-state-infra-repository]
aws_iam_user.bia: Refreshing state... [id=BeatrizTantow]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.CI.aws_subnet.buildersJenkins will be created
  + resource "aws_subnet" "buildersJenkins" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.CI.aws_subnet.guiJenkins will be created
  + resource "aws_subnet" "guiJenkins" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.CI.aws_vpc.jenkins will be created
  + resource "aws_vpc" "jenkins" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "component" = "CI"
          + "terraform" = ""
        }
      + tags_all                         = {
          + "component" = "CI"
          + "terraform" = (known after apply)
        }
    }

  # module.authentication.aws_directory_service_directory.ldap will be created
  + resource "aws_directory_service_directory" "ldap" {
      + access_url        = (known after apply)
      + alias             = (known after apply)
      + dns_ip_addresses  = (known after apply)
      + edition           = "Standard"
      + enable_sso        = false
      + id                = (known after apply)
      + name              = "corp.bbbfake.com"
      + password          = (sensitive value)
      + security_group_id = (known after apply)
      + short_name        = (known after apply)
      + size              = (known after apply)
      + tags              = {
          + "component" = "HR"
          + "terraform" = ""
        }
      + tags_all          = {
          + "component" = "HR"
          + "terraform" = (known after apply)
        }
      + type              = "MicrosoftAD"

      + vpc_settings {
          + availability_zones = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # module.authentication.aws_iam_user.HR will be created
  + resource "aws_iam_user" "HR" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "HR"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.authentication.aws_subnet.ldap1 will be created
  + resource "aws_subnet" "ldap1" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.authentication.aws_subnet.ldap2 will be created
  + resource "aws_subnet" "ldap2" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.authentication.aws_vpc.ldap will be created
  + resource "aws_vpc" "ldap" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.1.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "component" = "HR"
          + "terraform" = ""
        }
      + tags_all                         = {
          + "component" = "HR"
          + "terraform" = (known after apply)
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @petrolifero, Action: `pull_request`*